---
kind: method
id: M:Autodesk.Revit.DB.ColorFillSchemeEntry.CanSetValue(System.Int32)
source: html/da4ba2f0-8907-3ab5-f96c-8d15a69e3dd3.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.CanSetValue Method

Checks whether StorageType of entry is Integer.

## Syntax (C#)
```csharp
public bool CanSetValue(
	int value
)
```

## Parameters
- **value** (`System.Int32`) - New Integer value.

## Returns
True if StorageType of the entry is Integer, false otherwise.